## Plan Result (ptl-jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.env_subscription_id2[&#34;demo&#34;]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;dev&#34;]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;ithc&#34;]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;prod&#34;]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;stg&#34;]
  * azurerm_key_vault_secret.env_subscription_id2[&#34;test&#34;]
  * random_password.jenkins-agent-password2
  * random_password.jenkins-agent-password3
* Update
  * azurerm_key_vault_secret.jenkins-agent-password
* Delete
  * azurerm_cosmosdb_sql_role_assignment.this
  * azurerm_key_vault_secret.db




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.this will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.this is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      - account_name        = "sds-jenkins-pipeline-metrics" -> null
      - id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlRoleAssignments/7f30322b-c657-d539-9454-84ff9ee9e634" -> null
      - name                = "7f30322b-c657-d539-9454-84ff9ee9e634" -> null
      - principal_id        = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - resource_group_name = "sds-jenkins-ptl-rg" -> null
      - role_definition_id  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics" -> null
    }

  # azurerm_key_vault_secret.db will be destroyed
  # (because azurerm_key_vault_secret.db is not in configuration)
  - resource "azurerm_key_vault_secret" "db" {
      - content_type   = "" -> null
      - id             = "https://ptl.vault.azure.net/secrets/cosmosdb-token-key/e79178d692954ea28ab8efb62f24b764" -> null
      - key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl" -> null
      - name           = "cosmosdb-token-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "e79178d692954ea28ab8efb62f24b764" -> null
      - versionless_id = "https://ptl.vault.azure.net/secrets/cosmosdb-token-key" -> null
    }

  # azurerm_key_vault_secret.env_subscription_id2["demo"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "demo-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id2["dev"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "dev-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id2["ithc"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "ithc-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id2["prod"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "prod-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id2["stg"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "stg-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id2["test"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id2" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl"
      + name           = "test-subscription-id2"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.jenkins-agent-password will be updated in-place
  ~ resource "azurerm_key_vault_secret" "jenkins-agent-password" {
        id             = "https://ptl.vault.azure.net/secrets/jenkins-agent-password/ff0bbfa3cdfa4be192346b334103448a"
        name           = "jenkins-agent-password"
      ~ tags           = {
          + "foo"  = "foobar"
          + "hi"   = "hello"
          + "roo"  = "ruby"
          + "test" = "testing"
        }
        # (5 unchanged attributes hidden)
    }

  # random_password.jenkins-agent-password2 will be created
  + resource "random_password" "jenkins-agent-password2" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jenkins-agent-password3 will be created
  + resource "random_password" "jenkins-agent-password3" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 14
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 8 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->